; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v6 ?v8)
             (pred_5 ?v9 ?v12)
             (pred_11 ?v6 ?v12)
             (pred_3 ?v5 ?v6 )
	     (pred_12 ?v6)
             (pred_10 ?v4)
             (pred_7 ?v9)
             (pred_1 ?v12)
             (pred_6 ?v6)
             (pred_9 ?v9)
             (pred_8 ?v6)
             (pred_4 ))



(:action op_2
:parameters (?v7 ?v10 ?v11 ?v1)
:precondition (and (pred_10 ?v7) (pred_10 ?v10) (pred_7 ?v11) (pred_1 ?v1)
          (pred_2 ?v7 ?v10) (pred_5 ?v11 ?v1)
                   (pred_11 ?v10 ?v1) (pred_12 ?v7) 
                   (pred_6 ?v10) (pred_9 ?v11))
:effect (and  (pred_8 ?v10) (not (pred_6 ?v10))))


(:action op_1
:parameters (?v7 ?v3)
:precondition (and (pred_10 ?v7) (pred_10 ?v3)
               (pred_12 ?v7) (pred_2 ?v7 ?v3) (pred_8 ?v3))
:effect (and (pred_12 ?v3) (not (pred_12 ?v7))))

(:action op_3
:parameters (?v7 ?v11)
:precondition (and (pred_10 ?v7) (pred_7 ?v11) 
                  (pred_12 ?v7) (pred_3 ?v11 ?v7) (pred_4 ))
:effect (and (pred_9 ?v11)
   (not (pred_3 ?v11 ?v7)) (not (pred_4 ))))


(:action op_5
:parameters (?v7 ?v13 ?v2)
:precondition (and (pred_10 ?v7) (pred_7 ?v13) (pred_7 ?v2)
                  (pred_12 ?v7) (pred_9 ?v2) (pred_3 ?v13 ?v7))
:effect (and (pred_9 ?v13) (pred_3 ?v2 ?v7)
        (not (pred_9 ?v2)) (not (pred_3 ?v13 ?v7))))

(:action op_4
:parameters (?v7 ?v11)
:precondition (and (pred_10 ?v7) (pred_7 ?v11) 
                  (pred_12 ?v7) (pred_9 ?v11))
:effect (and (pred_4 ) (pred_3 ?v11 ?v7) (not (pred_9 ?v11)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_13 obj_03 obj_21 obj_12 obj_05 obj_08 obj_11 obj_19 obj_14 obj_02 obj_16 obj_17 obj_20 obj_09 obj_07
    obj_06 obj_10
    obj_18 obj_15 obj_01
    )

    (:init
       (pred_4)

       (pred_10 obj_04)
       (pred_10 obj_13)
       (pred_10 obj_03)
       (pred_10 obj_21)
       (pred_10 obj_12)
       (pred_10 obj_05)
       (pred_10 obj_08)
       (pred_10 obj_11)
       (pred_10 obj_19)
       (pred_10 obj_14)
       (pred_10 obj_02)
       (pred_10 obj_16)
       (pred_10 obj_17)
       (pred_10 obj_20)
       (pred_10 obj_09)
       (pred_10 obj_07)
       (pred_1 obj_06)
       (pred_1 obj_10)
       (pred_7 obj_18)
       (pred_7 obj_15)
       (pred_7 obj_01)

       (pred_2 obj_04 obj_12)
       (pred_2 obj_04 obj_13)
       (pred_2 obj_13 obj_05)
       (pred_2 obj_13 obj_03)
       (pred_2 obj_13 obj_04)
       (pred_2 obj_03 obj_08)
       (pred_2 obj_03 obj_21)
       (pred_2 obj_03 obj_13)
       (pred_2 obj_21 obj_11)
       (pred_2 obj_21 obj_03)
       (pred_2 obj_12 obj_19)
       (pred_2 obj_12 obj_05)
       (pred_2 obj_12 obj_04)
       (pred_2 obj_05 obj_14)
       (pred_2 obj_05 obj_08)
       (pred_2 obj_05 obj_13)
       (pred_2 obj_05 obj_12)
       (pred_2 obj_08 obj_02)
       (pred_2 obj_08 obj_11)
       (pred_2 obj_08 obj_03)
       (pred_2 obj_08 obj_05)
       (pred_2 obj_11 obj_16)
       (pred_2 obj_11 obj_21)
       (pred_2 obj_11 obj_08)
       (pred_2 obj_19 obj_17)
       (pred_2 obj_19 obj_14)
       (pred_2 obj_19 obj_12)
       (pred_2 obj_14 obj_20)
       (pred_2 obj_14 obj_02)
       (pred_2 obj_14 obj_05)
       (pred_2 obj_14 obj_19)
       (pred_2 obj_02 obj_09)
       (pred_2 obj_02 obj_16)
       (pred_2 obj_02 obj_08)
       (pred_2 obj_02 obj_14)
       (pred_2 obj_16 obj_07)
       (pred_2 obj_16 obj_11)
       (pred_2 obj_16 obj_02)
       (pred_2 obj_17 obj_20)
       (pred_2 obj_17 obj_19)
       (pred_2 obj_20 obj_09)
       (pred_2 obj_20 obj_14)
       (pred_2 obj_20 obj_17)
       (pred_2 obj_09 obj_07)
       (pred_2 obj_09 obj_02)
       (pred_2 obj_09 obj_20)
       (pred_2 obj_07 obj_16)
       (pred_2 obj_07 obj_09)
       (pred_6 obj_09)
       (pred_6 obj_21)
       (pred_6 obj_19)
       (pred_11  obj_09 obj_06)
       (pred_11  obj_21 obj_10)
       (pred_11  obj_19 obj_10)
       (pred_8 obj_04)
       (pred_8 obj_13)
       (pred_8 obj_03)
       (pred_8 obj_12)
       (pred_8 obj_05)
       (pred_8 obj_08)
       (pred_8 obj_11)
       (pred_8 obj_14)
       (pred_8 obj_02)
       (pred_8 obj_16)
       (pred_8 obj_17)
       (pred_8 obj_20)
       (pred_8 obj_07)

       (pred_5  obj_18 obj_06)
       (pred_5  obj_15 obj_10)
       (pred_5  obj_01 obj_10)
       (pred_3 obj_18 obj_02)
       (pred_3 obj_15 obj_17)
       (pred_3 obj_01 obj_05)
       (pred_12 obj_04)
    )

    (:goal (and
       (pred_3 obj_18 obj_17)
       (pred_3 obj_01 obj_07)
    ))
(:constraints
  (always (not (pred_12 obj_08)))
)
)

; plan
1. (op_1 obj_04 obj_12)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_12)
   goals met: 0 of 2
2. (op_1 obj_12 obj_05)
   deleted: (pred_12 obj_12)
   added: (pred_12 obj_05)
   goals met: 0 of 2
3. (op_1 obj_05 obj_14)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_14)
   goals met: 0 of 2
4. (op_1 obj_14 obj_02)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_02)
   goals met: 0 of 2
5. (op_3 obj_02 obj_18)
   deleted: (pred_3 obj_18 obj_02) (pred_4)
   added: (pred_9 obj_18)
   goals met: 0 of 2
6. (op_1 obj_02 obj_14)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_14)
   goals met: 0 of 2
7. (op_1 obj_14 obj_20)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_20)
   goals met: 0 of 2
8. (op_2 obj_20 obj_09 obj_18 obj_06)
   deleted: (pred_6 obj_09)
   added: (pred_8 obj_09)
   goals met: 0 of 2
9. (op_1 obj_20 obj_17)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_17)
   goals met: 0 of 2
10. (op_4 obj_17 obj_18)
   deleted: (pred_9 obj_18)
   added: (pred_4) (pred_3 obj_18 obj_17)
   goals met: 1 of 2
11. (op_1 obj_17 obj_20)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_20)
   goals met: 1 of 2
12. (op_1 obj_20 obj_14)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_14)
   goals met: 1 of 2
13. (op_1 obj_14 obj_05)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_05)
   goals met: 1 of 2
14. (op_3 obj_05 obj_01)
   deleted: (pred_3 obj_01 obj_05) (pred_4)
   added: (pred_9 obj_01)
   goals met: 1 of 2
15. (op_1 obj_05 obj_14)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_14)
   goals met: 1 of 2
16. (op_1 obj_14 obj_02)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_02)
   goals met: 1 of 2
17. (op_1 obj_02 obj_16)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_16)
   goals met: 1 of 2
18. (op_1 obj_16 obj_07)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_07)
   goals met: 1 of 2
19. (op_4 obj_07 obj_01)
   deleted: (pred_9 obj_01)
   added: (pred_4) (pred_3 obj_01 obj_07)
   goals met: 2 of 2
